Content/20240704133744-opensearch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-05 Fri 12:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Opensearch (&amp; Dashboard)</title>
<meta name="author" content="Raj Patil" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Opensearch (&amp; Dashboard)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org08d5f67">1. Abstract</a></li>
<li><a href="#orgcd5e8ca">2. Strengths</a></li>
<li><a href="#orged355a9">3. diff&rsquo;d w/ BLEK</a></li>
<li><a href="#orgcf6373e">4. Migration</a></li>
<li><a href="#org30273b0">5. Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org08d5f67" class="outline-2">
<h2 id="org08d5f67"><span class="section-number-2">1.</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="20240704132635-elk.html#ID-a5d7c19d-d30a-466a-bac3-14d111278fcd">blek</a> is a faux OSL (not Apache 2.0 anymore), ergo ..</li>
<li>community driven and dedicated to FOSS philosophy</li>
<li>distributed search and analytics engine</li>
</ul>
</div>
</div>
<div id="outline-container-orgcd5e8ca" class="outline-2">
<h2 id="orgcd5e8ca"><span class="section-number-2">2.</span> Strengths</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Fast full-text search (like <a href="20240704132635-elk.html#ID-a5d7c19d-d30a-466a-bac3-14d111278fcd">Elasticsearch</a>)</li>
<li>Scalable to large datasets and queries</li>
<li>Real-time data ingestion and <a href="20231215153109-search.html#ID-656af4b9-648b-41f9-932b-cbf2d2017794">search</a></li>
<li>Analytics capabilities (aggregations, metrics)</li>
</ul>
</div>
</div>
<div id="outline-container-orged355a9" class="outline-2">
<h2 id="orged355a9"><span class="section-number-2">3.</span> diff&rsquo;d w/ BLEK</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-left">OpenSearch Equivalent</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Elasticsearch</td>
<td class="org-left">OpenSearch</td>
<td class="org-left">Core search and analytics engine. Functional overlap, but OpenSearch is a fork, not a drop-in replacement.</td>
</tr>

<tr>
<td class="org-left">Kibana</td>
<td class="org-left">OpenSearch Dashboards</td>
<td class="org-left">Visualization and management. Feature parity still developing.</td>
</tr>

<tr>
<td class="org-left">Logstash</td>
<td class="org-left">No direct equivalent</td>
<td class="org-left">OpenSearch can ingest data directly or via tools like Fluentd/Fluent Bit.</td>
</tr>

<tr>
<td class="org-left">Beats</td>
<td class="org-left">Partially covered by agents</td>
<td class="org-left">OpenSearch offers some data shippers (agents), but not the breadth of Beats. Community-driven alternatives may exist.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgcf6373e" class="outline-2">
<h2 id="orgcf6373e"><span class="section-number-2">4.</span> Migration</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://opensearch.org/docs/latest/upgrade-to/upgrade-to/">https://opensearch.org/docs/latest/upgrade-to/upgrade-to/</a></li>
<li><a href="https://opster.com/guides/opensearch/opensearch-basics/migrate-from-elasticsearch-to-opensearch/">https://opster.com/guides/opensearch/opensearch-basics/migrate-from-elasticsearch-to-opensearch/</a></li>
<li><a href="https://opensearch.org/blog/moving-from-opensource-elasticsearch-to-opensearch">https://opensearch.org/blog/moving-from-opensource-elasticsearch-to-opensearch</a></li>
</ul>
</div>
</div>
<div id="outline-container-org30273b0" class="outline-2">
<h2 id="org30273b0"><span class="section-number-2">5.</span> Resources</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://opensearch.org/">https://opensearch.org/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Raj Patil</p>
<p class="date">Created: 2024-07-05 Fri 12:28</p>
</div>
</body>
</html>
